{
    "article_1": {
        "title": "Experts Recommend Using Hunger As Egg Substitute",
        "content": "\tWASHINGTON—In the wake of soaring egg prices and shortages nationwide, food experts from the U.S. Department of Agriculture released new guidelines Friday recommending the use of hunger as an appropriate egg substitute. “Whether used as a binder in baked goods or on its own as a savory breakfast, not eating can be substituted for eggs in most recipes,” said a USDA spokesperson, citing the practice as a popular method of food preparation that dates back to the Great Depression, when many Americans had nothing on hand in the pantry, making hunger a practical alternative for many meals. “In the finished product, you’ll hardly notice a difference between the pangs of starvation and the pleasant feeling of satiation that comes from necessary, balanced nutrition. It’s also vegan, cost-effective, and much lower in cholesterol compared to a typical egg-based dish. Note that two hours of a painfully empty stomach is roughly equal to one egg, though, so you’ll likely need to suffer at a two-to-one ratio per lack of egg.” USDA officials added that many people found imagining eating an egg far more flavorful than substituting with egg whites.",
        "link": "https://theonion.com/experts-recommend-using-hunger-as-egg-substitute/"
    },
    "article_2": {
        "title": "Taylor Swift Spends Evening Editing Spreadsheet Ranking All Her Friendships",
        "content": "\tBEVERLY HILLS, CA—In an attempt to stay organized as she balances the demands of fame and her personal life, pop superstar Taylor Swift reportedly spent Monday night editing the spreadsheet in which she ranks all of her friendships. “Hmm, I think Selena [Gomez] can stay at the number-four spot—things were looking a little dicey with the Emilia Pérez backlash, but I think we’re on steadier ground now,” said the 35-year-old recording artist, muttering to herself while indecisively dragging a cell bearing the name “Donna Kelce” around to different positions in the 17,300-row spreadsheet that she has painstakingly maintained since 2006. “I could see Hailee [Steinfeld] having some potential to move up a few spots if she plays her cards right, but we haven’t talked since she did the ‘Bad Blood’ video. Then again, there’s a little more flexibility there now that Olivia [Rodrigo]’s off the list. Maybe I move Donna into her old spot? According to my formulas, the math checks out.” At press time, Swift was said to be agonizing between Katy Perry or Brittany Mahomes for the last place and second-to-last place positions.",
        "link": "https://theonion.com/taylor-swift-spends-evening-editing-spreadsheet-ranking-all-her-friendships/"
    },
    "article_3": {
        "title": "Washington Wizards Reminded That Bottled Water In Hotel Room Isn’t Free",
        "content": "\tORLANDO, FL—Emphasizing that he absolutely would not tolerate another away game that ended with over $200 in room charges, Washington Wizards coach Brian Keefe reportedly reminded his team Sunday that the bottled water in their hotel wasn’t free. “I know they don’t have a price tag on them, but any water bottles in or around the mini fridge are strictly off-limits,” Keefe said to all 18 of his players, adding that while the players were not to drink the Evian water on their nightstands, they were more than welcome to bring their Nalgenes and use the refilling station down the hall or use a glass to drink water from the tap in their bathroom. “I realize you guys didn’t know any better last time around, but each of those Toblerones is, like, $10. Also, don’t let the hotel staff see [team scoring leader] Jordan [Poole]. You might be sleeping three to a bed, but it’s cheaper if they only know about two.” According to reports, Keefe also told the players to eat as much as they could at the hotel’s complimentary continental breakfast because they wouldn’t be eating again until dinner.",
        "link": "https://theonion.com/washington-wizards-reminded-that-bottled-water-in-hotel-room-isnt-free/"
    },
    "article_4": {
        "title": "NBC Producers Deny Using AI In New Series ‘Detective Fireman Lawyer Chicago Los Angeles Show’",
        "content": "\tNEW YORK—Issuing a categorical denial of the accusations, NBC producers announced Thursday there was absolutely no usage of artificial intelligence in the new series Detective Fireman Lawyer Chicago Los Angeles Show. “At NBC, we are passionate about storytelling, and the truth is that machine learning isn’t capable of bringing to life vibrant characters like Jim Jack John Zander Chase Johnson Jackson, a man who is barely hanging on as he balances his hectic work life with alcoholism dead child gambling attempted suicide problem,” said producer Tanya Nance, telling reporters that everything from the series’ opening shot of courtroom explosion precinct skyscraper ocean cliff on had come entirely from the minds of the show’s creators. “We understand that tensions are high around the issue of using large language models in entertainment, but rest assured that only a passionate team of experienced writers could deliver on a premise like this. I’m confident that audiences will be hooked from the moment they find out who is behind the murder arson big case DNA evidence opposing counsel. And while I don’t want to give too much away about the future of the show, let’s just say that there’s more to our hero than meets the eye con artist ghost mobster drug dealer elf.” At press time, Nance admitted that invalid input format invalid input format invalid input format quota exceeded too many input requests.",
        "link": "https://theonion.com/nbc-producers-deny-using-ai-in-new-series-detective-fireman-lawyer-chicago-los-angeles-show/"
    },
    "article_5": {
        "title": "Dad Spends Daughter’s Wedding Day Thinking About History Of Oil",
        "content": "\tMOUNT CLEMENS, MI—With guests congratulating him and his family as his mind drifted back from the very beginnings of ancient organic matter becoming trapped beneath the Earth’s surface, local dad Brendan Canfield reportedly spent his daughter Ellie’s wedding Friday thinking about the history of oil. According to sources, the father walked the bride down the aisle while considering the ingenuity of men like Abraham Gesner, who harnessed the natural power of oil as kerosene, and pondering the rush for energy-dense hydrocarbons that led to the explosive growth of cities like Los Angeles. Witnesses also reported that when his daughter and her betrothed exchanged vows, a tear welled up in Canfield’s eye, a result of contemplating the incredible human ingenuity that led to plastics, cosmetics, and all the other goods that fueled the greatest economic boom in human history. At press time, a smile was seen growing upon the dad’s face as he shook the hand of his daughter’s new husband and remembered that his name was Derek.",
        "link": "https://theonion.com/dad-spends-daughters-wedding-day-thinking-about-history-of-oil/"
    }
}