{
    "article_1": {
        "title": "Global smartwatch sales fall for first time",
        "content": "Global sales of smartwatches have fallen for the first time, new figures indicate, in large part due to a sharp decline in the popularity of market leader, Apple. Market research firm Counterpoint says 7% fewer of the devices were shipped in 2024 compared to the year before. Shipments of Apple Watches fell by 19% in that period, Counterpoint says. It blames the slump on a lack of new features in Apple's latest devices, and the fact a rumoured high-end Ultra 3 model never materialised. 'The biggest driver of the decline was North America, where the absence of the Ultra 3 and minimal feature upgrades in the S10 lineup led consumers to hold back purchases,' said Counterpoint senior research analyst Anshika Jain. Apple was also hit with sales and import bans in the US in late 2023 and early 2024 over a disputed patent regarding blood oxygen level monitoring - which Ms Jain says also contributed to lower sales figures in the first half of 2024. It retained 22% of market share in the final three months of 2024, down from 25% a year earlier. 'We've been through a period where the smartwatch has gone from being a new and exciting gadget, to something now that's stabilising - the feature set isn't changing very dramatically year over year,' said Leo Gebbie, principal analyst at CCS Insight. Despite the overall decline, last year did see a massive rise in sales for Chinese-made smartwatches from brands such as Xiaomi, Huawei and Imoo.",
        "link": "https://www.bbc.co.uk/news/articles/cx20d3r7p5do"
    },
    "article_2": {
        "title": "Rasmus Hojlund copies Cristiano Ronaldo's goal celebration as Denmark beat Portugal in Nations League",
        "content": "asmus Hojlund performed Cristiano Ronaldo's goal celebration after scoring the winner for Denmark against Portugal in the Nations League on Thursday.  Hojlund came off the bench to net the winner in his side's 1-0 Nations League quarter-final first-leg victory at Parken Stadium. The Manchester United striker struck in the 78th minute to help spare the blushes of Christian Eriksen, whose first-half penalty was saved.",
        "link": "https://www.skysports.com/football/news/11667/13332884/rasmus-hojlund-copies-cristiano-ronaldos-goal-celebration-as-denmark-beat-portugal-in-nations-league"
    },
    "article_3": {
        "title": "Parrots and humans share a brain mechanism for speech",
        "content": "When it comes to speech, parrots have the gift of gab. And the way the brains of small parrots known as budgerigars bestow this gift is remarkably similar to human speech, researchers report March 19 in Nature.  So far, budgerigars are the only animals known to have language-producing centers akin to those in humans, says Michael Long, a neuroscientist at New York University Langone Health. This “is really the first nonhuman animal in which that has been shown.” Understanding how speech gets created in budgies’ brains could help clarify what goes wrong in certain communication disorders in people. Budgerigars (Melopsittacus undulatus) are tropical-colored, smart cutie pies. Beyond their looks, these parrots are particularly social and chatty, making them interesting research subjects for language studies. Long and his Langone Health colleague Zetian Yang tracked the behavior of individual nerve cells in four of these birds’ brains as they produced their chirrups. The activity of these cells, nestled in a part of the brain called the anterior arcopallium, is tied to the sounds the birds make, the duo found.The organization of these neurons’ activity, it turns out, is pretty simple, Long says. He compares this neural organization to a keyboard that can produce a range of sounds — consonants, vowels, high pitches and low pitches. A budgie “is able to generate arbitrary sounds in its universe by just playing this vocal keyboard,” Long says. Overall, this flexible system has a humanlike organization.The similarities between human and parrot brains may reflect two species solving a problem in a similar way, neurally speaking. These parallels could be “a very tidy example of convergent evolution, where you have humans that have developed this kind of neural mechanism for speech, and these parrots have developed a kind of similar mechanism,” Long says.Now that scientists know more about how budgie brains help the birds talk, another question dogs Long: What are these parrots talking about?“We are trying now to translate budgie,” he says, using advanced machine learning to determine what each warble and chirp means. Perhaps their language itself — not just the way their brain creates it — is similar to that of people. With these kinds of experiments, Long says, “maybe we can start to reexamine the notions of human exceptionalism.”",
        "link": "https://www.sciencenews.org/article/parrots-humans-brain-speech-birds"
    },
    "article_4": {
        "title": "Iguanas floated 5,000 miles from North America to Fiji on vegetation rafts, new study finds",
        "content": " Around 34 million years ago, the ancestors of modern iguanas likely embarked on what may be the longest overwater journey undertaken by a nonhuman, land-dwelling vertebrate species.Starting off the epic trek from the western coast of North America, these iguanas traveled nearly 5,000 miles (8,000 kilometers) — one-fifth of the Earth’s circumference — across the Pacific Ocean, eventually arriving in Fiji, according to a new study.Using genetic evidence, researchers propose that these iguanas made the extraordinary voyage by rafting on floating vegetation, possibly composed of uprooted trees or plants.For decades, scientists have debated how Fiji’s iguanas arrived. Previous theories suggested that an extinct species of iguana rafted from the Americas without a clear timeline, while others proposed that the lizards migrated overland from Asia or Australia, said lead study author Dr. Simon Scarpetta, an assistant professor at the University of San Francisco. Scarpetta conducted this research during his National Science Foundation postdoctoral fellowship at the University of California, Berkeley, and in his current role.The findings, published Monday in the journal Proceedings of the National Academy of Sciences, help clarify the long-standing mystery of how these reptiles reached such remote islands.  Scarpetta and his team aimed to test both the overwater rafting and overland theories, as well as other hypotheses for the biogeographic origin of Fijian iguanas, including dispersal through Antarctica or across the Bering land bridge.Understanding this type of water dispersal could offer new insights into how other species have colonized isolated areas over time, Scarpetta added.  Iguanas have already demonstrated an ability to survive long-distance ocean travel, according to an October 1998 study. At least 15 green iguanas appeared on the beaches of Anguilla in the Caribbean in 1995 on rafts of uprooted trees. Researchers determined the lizards likely floated nearly 200 miles (322 kilometers) from Guadeloupe following a hurricane event.Scarpetta noted that this type of overwater rafting is often described as “sweepstakes” dispersal, a rare event that allows a species to colonize an otherwise unreachable area. Major weather events, such as hurricanes or floods, can dislodge vegetation and carry animals along with it.To determine when iguanas arrived in Fiji, researchers analyzed the genes of 14 living iguana species. The team found that the closest living relative of Fijian iguanas is the Dipsosaurus — a type of desert iguana native to the southwestern United States and northwestern Mexico, according to the new study.Fossil evidence further supports the idea that these iguanas originated in North America, as no fossils of desert iguanas have been found elsewhere in the world, Scarpetta said.The analysis also suggests that the Fijian iguanas diverged from their American ancestors between 34 million and 30 million years ago, settling around the same time as the volcanic formation of the Fijian archipelago, Scarpetta said.   This timeline challenges previous theories that iguanas may have made a complex overland journey from South America via Antarctica, which would have happened much later in history, said study coauthor Dr. Jimmy McGuire, a professor of integrative biology at University of California, Berkeley.“In phylogenetic analyses there is always some degree of uncertainty when trying to predict the timing of divergence events between species,” said Dr. Shane Campbell-Staton, an associate professor of ecology and evolutionary biology at Princeton University, who was not involved in the study. “In this case, the authors were very thorough in collecting multiple different kinds of genetic data and use(d) multiple different models … to test their hypothesis and find that most of the results are largely in agreement.”  While a monthslong voyage across the Pacific may seem impossible, iguanas are surprisingly well-equipped for such extreme travel.“If you had to pick a vertebrate group that could survive a rafting event across thousands of kilometers of open ocean, iguanas are a great choice,” Scarpetta said.Many iguana species, especially those in desert environments, can endure extreme heat, starvation and dehydration, Scarpetta noted.“Being ectothermic means that you don’t expend many of your food resources or fat reserves maintaining an elevated body temperature,” McGuire said, referring to the metabolic rate of cold-blooded animals. “Ectotherms can be about 25 times more efficient in this regard than endotherms (warm-blooded animals), so they don’t need to eat nearly as much food nor nearly so frequently.”   Some estimates suggest that an overwater journey from North America to Fiji could have taken anywhere from four to 12 months. However, newer simulations indicate the trip may have been closer to 2 ½ to four months, Scarpetta said.Despite basic survival challenges, food scarcity likely wouldn’t have been a major one. If necessary, the herbivorous reptiles may have been able to feed on their floating vegetation mats, McGuire said.Scientists said they hope that by studying dispersal events, they may be able to predict which species can survive long-distance overwater travel, offering new insights into how animals spread across the globe.“We now know that overwater dispersal is not only possible, but it has likely played a large role in shaping species diversity on islands around the world,” Campbell-Staton said via email. ",
        "link": "https://edition.cnn.com/2025/03/21/science/iguanas-fiji-pacific-ocean-vegetation-rafts/index.html"
    },
    "article_5": {
        "title": "300-year-old Polish beech voted Tree of the Year",
        "content": "The Heart of the Dalkowskie Hills, a breathtaking 300-year-old beech, has won Poland the European Tree of the Year award for the fourth consecutive time.Standing tall in Dalków's historic park, the deep-red beauty is a beloved symbol for the community.Visitors also have a quirky tradition: tossing peanuts into a hole in it, hoping for their wishes to come true.The contest celebrates our relationship with nature by showcasing beautiful and unique trees from across the continent. Taking second place is the majestic Portuguese Moreton Bay Fig.This tree was planted in the 19th Century in Coimbra's romantic Quinta das Lágrimas Gardens from seeds exchanged with Sydney's Botanical Garden and is a treasured landmark. In third place is the Pino de Juan Molinera.A 400-year-old stone pine in Abengibre, Spain, this tree has sheltered generations of locals and witnessed countless celebrations, childhood games and romances.It has endured floods, snowstorms and a lightning strike, standing as a testament to resilience and history.  The Skipinnish Oak in Scotland, UK is a 400-year-old giant, standing proudly in Lochaber's woodland.It is one of the region's largest oaks and a vital ecosystem for rare lichens like the black-eyed Susan.Recently crowned the UK winner, it is a beloved local treasure. The Old Chestnut of Sint-Rafaël in Belgium is a 150– to 200-year-old witness to the history of Sint-Job-in-'t-Goor. The Tree of Freedom in Rab, Croatia, is a 105-year-old holm oak that stands as a symbol of community and heritage.Generations have cherished it, with many families passing down stories of ancestors who helped plant it. Its centennial was celebrated with a grand event, honouring its role in the town's history. The Lukavice Oak in the Czech Republic is a 700- to 800-year-old survivor, once threatened by estate owners who tried to remove its soil.Defying destruction, it still stands strong, symbolising resilience and pride for the local community.",
        "link": "https://www.bbc.co.uk/news/articles/c20dd6yk55yo"
    }
}